Synthesizing design: sync.sv

                      Design Compiler Graphical
                            DC Ultra (TM)
                             DFTMAX (TM)
                         Power Compiler (TM)
                           DesignWare (R)
                           DC Expert (TM)
                         Design Vision (TM)
                          HDL Compiler (TM)
                         VHDL Compiler (TM)
                            DFT Compiler
                        Library Compiler (TM)
                         Design Compiler(R)

            Version G-2012.06 for RHEL64 -- May 30, 2012
               Copyright (c) 1988-2012 Synopsys, Inc.

This software and the associated documentation are confidential and 
proprietary to Synopsys, Inc. Your use or disclosure of this software 
is subject to the terms and conditions of a written license agreement 
between you, or your company, and Synopsys, Inc.

Initializing...
dc_shell> dc_shell> Running PRESTO HDLC
Searching for ./sync.sv
Searching for /package/eda/synopsys/syn-G-2012.06/libraries/syn/sync.sv
Searching for /package/eda/synopsys/syn-G-2012.06/dw/sim_ver/sync.sv
Searching for ./source/sync.sv
Compiling source file ./source/sync.sv
Presto compilation completed successfully.
Loading db file '/package/eda/cells/OSU/v2.7/synopsys/lib/ami05/osu05_stdcells.db'
Loading db file '/package/eda/synopsys/syn-G-2012.06/libraries/syn/dw_foundation.sldb'
1
dc_shell> Loading db file '/package/eda/synopsys/syn-G-2012.06/libraries/syn/gtech.db'
Loading db file '/package/eda/synopsys/syn-G-2012.06/libraries/syn/standard.sldb'
  Loading link library 'osu05_stdcells'
  Loading link library 'gtech'
Running PRESTO HDLC

Inferred memory devices in process
	in routine sync line 21 in file
		'./source/sync.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     out_one_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine sync line 33 in file
		'./source/sync.sv'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     sec_out_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Elaborated 1 design.
Current design is now 'sync'.
1
dc_shell> dc_shell> 1
dc_shell> dc_shell> dc_shell> Warning: Can't find object 'sensors[2]' in design 'sync'. (UID-95)
Error: Value for list '-from' must have 1 elements. (CMD-036)
Warning: Can't find object 'error' in design 'sync'. (UID-95)
Error: Value for list '-to' must have 1 elements. (CMD-036)
0
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | G-2012.06-DWBB_201206.0 |     *     |
| Licensed DW Building Blocks        | G-2012.06-DWBB_201206.0 |           |
============================================================================



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'sync'

  Updating timing information
Information: Updating design information... (UID-85)
Information: Design 'sync' has no optimization constraints set. (OPT-108)

  Beginning Mapping Optimizations  (Medium effort)
  -------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
Loading db file '/package/eda/cells/OSU/v2.7/synopsys/lib/ami05/osu05_stdcells.db'

  Optimization Complete
  ---------------------
1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Writing verilog file '/home/ecegrid/a/mg23/ece337/Lab2/mapped/sync.v'.
1
dc_shell> dc_shell> dc_shell> dc_shell> 1
dc_shell> 

  Beginning Pass 1 Mapping
  ------------------------
  Processing 'sync'

  Updating timing information
Information: Updating design information... (UID-85)
Information: Design 'sync' has no optimization constraints set. (OPT-108)

  Beginning Mapping Optimizations  (High effort)
  -------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
    0:00:00    3168.0      0.00       0.0       0.0                          
Loading db file '/package/eda/cells/OSU/v2.7/synopsys/lib/ami05/osu05_stdcells.db'

  Optimization Complete
  ---------------------
1
dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> dc_shell> Writing verilog file '/home/ecegrid/a/mg23/ece337/Lab2/mapped/sync_1.v'.
1
dc_shell> dc_shell> 
Script Done

dc_shell> 
Checking Design

dc_shell> 1
dc_shell> 
Thank you...
Done


